--------------------------------------------------------------------------------
-- GLOBAL		Объяввляем глобальные переменные и функции
--------------------------------------------------------------------------------


--------------------------------------------------------------------------------
-- EVENT HANDLERS		Тело с функциями (основное рабочее пространство)
--------------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------
-- Функция Определения вещей для квеста в сумке
function BuffRem( params )

	local buffName = userMods.FromWString(params.buffName)
	-- LogInfo( "itemInfo.name=", buffName, params.buffId, params.sysName )
	
	if buffName == "Ускорение" then
		
		-- Получаем информацию о карте где находится юзер
		local zoneInfo = cartographer.GetCurrentZoneInfo()
		local zoneName = userMods.FromWString(zoneInfo.zoneName)
		if zoneName ~= "Башня Порядка" and zoneName ~= "Битва за Каргаллас" then
			return
		end
		
		object.RemoveBuff( params.buffId )
	end

end


--------------------------------------------------------------------------------
-- CHECKED AVATAR AND DATE		Проверки создания аватара, даты и прочее до начала работы основных скриптов
--------------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------
-- Функция запускающаяся с момента создания Аватара в игре (после его захода)
function OnEventAvatarCreated()

	common.RegisterEventHandler(BuffRem, "EVENT_OBJECT_BUFF_ADDED", avatar.GetId() )

end


--------------------------------------------------------------------------------
-- INITIALIZATION		Создаем Главную функцию запускающую другие в зависимости от определенных событий в игре
--------------------------------------------------------------------------------
function Init()

	-- Вызываем функцию при создании игрока (при входе в игру)
	common.RegisterEventHandler(OnEventAvatarCreated, "EVENT_AVATAR_CREATED")
	-- Если игрок уже создан то тоже вызываем функцию
	if avatar.IsExist() then
		OnEventAvatarCreated()
	end

end
--------------------------------------------------------------------------------
-- Запускаем функцию с запускалками
Init()
--------------------------------------------------------------------------------