----------------------------------------------------------------------------------------------------------
-- Система сообщений
----------------------------------------------------------------------------------------------------------
do
----------------------------------------------------------------------------------------------------------
-- Бафы на мобах  о которых нужо сообщить рейду/группе
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- {"Имя бафа", Количество стаков при котором сообщать (1 - при появлении), время отображения сообщения в секундах, "цвет", "Имена мобов с бафом через запятую, после запятой обязательно пробел" (если указано "" то имя не учитывается)}
----------------------------------------------------------------------------------------------------------
Setings.Notes.Buf_Units =
 {
  {"Барьер"                            , 1, 3, "red"  , ""},
  {"Безумный танец"                    , 1, 3, "red"  , "Мольпа"},
  {"Бешенство"                         , 1, 3, "red"  , ""},
--  {"Вихрь клинков"                     , 1, 3, "red"  , ""},
  {"Гневный топот"                     , 1, 3, "red"  , ""},
  {"Дикая пляска"                      , 1, 3, "red"  , "Кок Пит"},
  {"Жаркое лето"                       , 1, 3, "red"  , "Лето Ясное"},
  {"Жертва"                            , 1, 3, "red"  , "Возрождённый воитель"},
  {"Жуткий вой"                        , 1, 3, "red"  , "Шорох"},
  {"За гранью безумия"                 , 1, 3, "red"  , ""},
  {"Застывшая жизнь"                   , 1, 3, "red"  , "Торос"},
  {"Злоба"                             , 1, 3, "red"  , "Медведица, Шорох"},
  {"Испепеление"                       , 1, 3, "red"  , ""},
  {"Истребление"                       , 1, 3, "red"  , ""},
  {"Красная пелена"                    , 1, 3, "red"  , "Бузаги-бей"},
  {"Ледяная статуя"                    , 1, 3, "green", ""},
  {"Мелодия гнева"                     , 1, 3, "red"  , ""},
  {"Мельница"                          , 1, 3, "red"  , "Тётка Агафья"},
  {"Месть павших"                      , 1, 3, "red"  , "Мецтлитотек"},
  {"Молитва"                           , 1, 3, "red"  , "Мецтлитотек"},
  {"Ням-Ням"                           , 1, 3, "red"  , "Кракен"},
  {"Огненный ветер"                    , 1, 3, "red"  , "Добробой Великов"},
  {"Огненный щит"                      , 1, 3, "red"  , "Заклинатель огня"},
  {"Окровавленные пальцы"              , 1, 3, "red"  , "Аннет ди Тристес"},
  {"Охота"                             , 1, 3, "red"  , "Евстигней Волков"},
  {"Пиратская пляска"                  , 1, 3, "red"  , ""},
  {"Погоня"                            , 1, 3, "red"  , ""},
  {"Подготовка к акустическому барьеру", 1, 3, "red"  , ""},
  {"Приоритетная цель"                 , 1, 3, "green", ""},
  {"Притоп"                            , 1, 3, "red"  , "Слепец"},
  {"Разбег"                            , 1, 3, "red"  , ""},
  {"Разрушительный луч"                , 1, 3, "red"  , ""},
  {"Растущая злоба"                    ,50, 3, "red"  , "Кракен"},
  {"Режим повышенной опасности"        , 1, 3, "red"  , "Бронзовый камнетёс"},
  {"Резонанс"                          , 1, 3, "red"  , "Вышибала"},
  {"Силовая броня"                     , 1, 3, "red"  , "Нихиль"},
  {"Силовой щит"                       , 1, 3, "red"  , "Опытный образец"},
  {"Синергия"                          , 1, 3, "red"  , "«Десница», «Шуйца»"},
  {"Стальное торнадо"                  , 1, 3, "red"  , ""},
  {"Сытость"                           , 1, 3, "red"  , "Долгобрюх"},
  {"Таран"                             , 1, 3, "red"  , ""},
  {"Увлечённость"                      , 1, 3, "green", "Белёк"},
  {"Шипастая броня"                    , 1, 3, "red"  , ""},
  {"Щит стихий"                        , 1, 3, "red"  , ""},
  {"Ярость"                            , 1, 3, "red"  , ""},
  {"Солнцеворот"                       , 1, 3, "red"  , "Смеяна"},
  {"Созвездие Мудреца"                 , 1, 3, "red"  , "Лунная тень"},
  {"Созвездие Охотника"                , 1, 3, "red"  , "Лунная тень"},
  {"Созвездие Девы"                    , 1, 3, "red"  , "Лунная тень"},
  {"Созвездие Магистра"                , 1, 3, "red"  , "Лунная тень"},
  {"Созвездие Мастера"                 , 1, 3, "red"  , "Лунная тень"},
  {"Хаотичная атака"                   , 1, 3, "red"  , "Интеграл"}
 }
----------------------------------------------------------------------------------------------------------
-- Бафы на игроках о которых нужо сообщить рейду/группе
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- {"Имя бафа", "Количество стаков при котором сообщать (1 - при появлении)", время отображения сообщения в секундах, "цвет", "Имя автора бафа через запятую, после запятой обязательно пробел" (если указано "" то автор не учитывается)}
----------------------------------------------------------------------------------------------------------
Setings.Notes.Buf_Players = 
 {
  {"Астральная пандемия"        ,  1, 3, "red"  , ""},
  {"Бомба-липучка"              ,  1, 3, "red"  , ""},
  {"Буря клинков"               ,  1, 3, "red"  , ""},
  {"Бутерброд"                  ,  1, 3, "green", ""},
  {"Возврат урона"              ,  1, 3, "red"  , "Синюшка"},
  {"Восточная тень"             ,  1, 3, "red"  , ""},
  {"Выпит досуха"               ,  1, 3, "red"  , ""},
  {"Гибельное проклятье"        ,  1, 3, "red"  , ""},
  {"Глубокая заморозка"         ,  1, 3, "red"  , "Бука-бука"},
  {"Глубокое обморожение"       ,  6, 3, "red"  , "Механический богатырь"},
  {"Горение"                    ,  6, 3, "red"  , "Механический богатырь"},
  {"Губительный свет"           ,  1, 3, "red"  , ""},
  {"Густой туман"               ,  6, 3, "red"  , "Механический богатырь"},
  {"Дикая пляска"               ,  1, 3, "red"  , ""},
  {"Духовные узы"               ,  1, 3, "red"  , ""},
  {"Жажда крови"                ,  1, 3, "red"  , "Заражённый боец"},
  {"Зажигательная бомба"        ,  1, 3, "red"  , ""},
  {"Замыкание"                  ,  1, 3, "red"  , ""},
  {"Западная тень"              ,  1, 3, "red"  , ""},
  {"Заражение"                  ,  1, 3, "red"  , ""},
  {"Зарождение безумия"         ,  1, 3, "red"  , ""},
  {"Заряженная стрела"          ,  1, 3, "red"  , ""},
  {"Затмение"                   ,  1, 3, "red"  , ""},
  {"Звёздный барьер"            ,  1, 3, "red"  , ""},
  {"Исторжение жизни"           ,  1, 3, "red"  , ""},
  {"Истязание"                  ,  1, 3, "red"  , ""},
  {"Коллапс"                    ,  1, 3, "red"  , ""},
  {"Колыбельная"                ,  1, 3, "red"  , "Левкосия, Страж Лиры"},
  {"Корм для птенцов"           ,  1, 3, "red"  , ""},
--  {"Литания"                    ,  1, 3, "green", ""},
  {"Метель"                     ,  1, 3, "red"  , ""},
  {"Милость"                    ,  1, 3, "green", ""},
  {"Моровая язва"               , 10, 3, "red"  , ""},
  {"На обед!"                   ,  1, 3, "red"  , ""},
  {"Необыкновенная лёгкость"    ,  1, 3, "red"  , "Недоля Тьмущинская"},
  {"Нестабильная бомба"         ,  1, 3, "red"  , ""},
  {"Обед червя"                 ,  1, 3, "red"  , ""},
  {"Объект ненависти"           ,  1, 3, "red"  , ""},
  {"Огненная бомба"             ,  1, 3, "red"  , ""},
  {"Огненный луч"               ,  1, 3, "red"  , ""},
  {"Ослепительное сияние"       ,  1, 3, "red"  , ""},
  {"Отравленные иглы"           ,  1, 3, "red"  , ""},
  {"Отрицательный заряд"        ,  1, 3, "red"  , ""},
  {"Перегрев"                   ,  6, 3, "red"  , ""},
  {"Переохлаждение"             , 80, 3, "red"  , ""},
  {"Пляска молний"              ,  1, 3, "red"  , ""},
  {"Погоня"                     ,  1, 3, "red"  , "Ссера-хай"},
  {"По пояс в снегу"            ,  1, 3, "red"  , ""},
  {"Преследование!"             ,  1, 3, "red"  , ""},
  {"Приманка"                   ,  1, 3, "red"  , ""},
  {"Проклятие слабости"         ,  1, 3, "red"  , ""},
  {"Путы проказы"               ,  1, 3, "red"  , ""},
  {"Разрази-гром"               ,  1, 3, "red"  , ""},
  {"Рывок"                      ,  1, 3, "red"  , "Жаросвят Семибратов"},
  {"Сгущающиеся тучи"           ,  1, 3, "red"  , ""},
  {"Северная тень"              ,  1, 3, "red"  , ""},
  {"Синхронизация"              ,  1, 3, "red"  , ""},
  {"Смертельная отрава"         ,  1, 3, "red"  , ""},
  {"Споры паразита"             ,  1, 3, "red"  , ""},
  {"Стихийная бомба"            ,  1, 3, "red"  , ""},
  {"Тепловая метка"             ,  1, 3, "red"  , ""},
  {"Тлен"                       ,  1, 3, "red"  , ""},
  {"Удавка"                     ,  1, 3, "red"  , "Рустам-ага"},
  {"Удушение"                   ,  1, 3, "red"  , ""},
--  {"Усталость"                  , 90, 3, "red"  , ""},
  {"Чума"                       ,  1, 3, "red"  , "Тэп"},
  {"Экспериментальное средство" ,  1, 3, "red"  , ""},
  {"Электромаяк"                ,  1, 3, "red"  , ""},
  {"Энергетический луч"         ,  1, 3, "red"  , ""},
  {"Эрозия брони"               ,  1, 3, "red"  , ""},
  {"Южная тень"                 ,  1, 3, "red"  , ""},
  {"Я слежу за тобой!"          ,  1, 3, "red"  , ""},
  {"Яростный свет"              ,  1, 3, "red"  , ""},
  {"Ярь-медянка"                ,  1, 3, "red"  , ""},
  {"Луч солнца"                 ,  1, 3, "red"  , ""},
  {"Добыча"                     ,  1, 3, "red"  , "Шорох"},
  {"Разлом пространства"        ,  1, 3, "red"  , "Вершитель"},
  {"Шальной смерч"              ,  1, 3, "red"  , ""},
  {"Обман"                      ,  1, 3, "red"  , ""},
  {"Иссушающий яд"              ,  1, 3, "red"  , ""},
  {"Приступ ярости"              ,  1, 3, "red"  , ""},
}
----------------------------------------------------------------------------------------------------------
-- Бафы на персонаже о появлении которых нужно сообщить (только игроку)
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- {"Имя бафа", "Количество стаков при котором сообщать (1 - при появлении)", "цвет", время отображения сообщения в секундах}
----------------------------------------------------------------------------------------------------------
Setings.Notes.Buf_Avatar = 
 {
  {"Боевое безумие"                  ,  1, "green", 3},
  {"Возгорание"                      ,  1, "red"  , 3},
  {"Вспышка"                         ,  1, "red"  , 3},
  {"Горение"                         ,  1, "red"  , 3},
  {"Камнепад"                        ,  1, "red"  , 3},
  {"Кислотная мина"                  ,  1, "red"  , 3},
  {"Коррозия"                        , 10, "red"  , 3},
  {"Минное поле"                     ,  1, "red"  , 3},
  {"Морозная корка"                  ,  1, "red"  , 3},
  {"Наслаждение муками"              ,  1, "red"  , 3},
  {"Непрочная броня"                 ,  1, "red"  , 3},
  {"Нервный зов"                     ,  1, "red"  , 3},
  {"Нервный узел"                    ,  1, "red"  , 3},
  {"Область взрыва"                  ,  1, "red"  , 3},
  {"Пламя страсти"                   ,  1, "red"  , 3},
  {"Прилив стихий"                   ,  1, "red"  , 3},
  {"Пылающая земля"                  ,  1, "red"  , 3},
  {"Россыпь Искр"                    ,  1, "red"  , 3},
--  {"Стремление к тьме"               ,  1, "green", 3},
  {"Контакт разумов"                 ,  1, "red"  , 3},
  {"Уязвимое место"                  ,  1, "red"  , 3},
  {"Фанатизм"                        ,  1, "green", 3},
  {"Цель громобоя"                   ,  1, "red"  , 3},
  {"Цель модернизированного громобоя",  1, "red"  , 3},
  {"Буйство стихий"                  ,  1, "green", 3},
  {"Надёжный захват"                 ,  1, "red"  , 3},
  {"Боевой раж"                     ,  15, "red"  , 3},
}
----------------------------------------------------------------------------------------------------------
-- Бафы на мобе которые запускают таймер
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя бафа", "Имя моба"(если указано "" то имя не учитывается), "цвет", "Сообщение при исчезновении бафа", максимальное время отслеживания в секундах}
----------------------------------------------------------------------------------------------------------
Setings.Notes.Timer = 
 {
  {"Внутренний огонь", "Нихаз", "red", "Разбег", 60},
  {"Глобальное преобразование", "Окулус", "red", "", 60},
 }
----------------------------------------------------------------------------------------------------------
-- Мобы о появлении которых нужно сообщать
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- {"Имя моба", 1 - простое сообщение 2 - проверять бафы на мобе} - Пустые кавычки не проверять наличие бафа
----------------------------------------------------------------------------------------------------------
Setings.Notes.Units = 
 {
  {"Аколит-огненного Отца",   1},
  {"Астральный защитник",     1},
  {"Большая сфера холода",    1},
  {"Воздушное копье",         1},
  {"Воплощённый ликтор",      1},
  {"Голем-подрывник",         1},
  {"Демон-подстрекатель",     1},
  {"Деревянный барабанщик",   1},
  {"Деревянный колосс",       1},
  {"Двойник ритуалист",       1},
  {"Живодёр",                 1},
  {"Замороженный элементаль", 1},
  {"Клянущий судьбу",         1},
  {"Кобольд-прихлебатель",    1},
  {"Корни",                   1},
  {"Мерзкое щупальце",        1},
  {"Ожившее пламя",           1},
  {"Оживший огонёк",          1},
  {"Пиротехник",              1},
  {"Пламенеющий людогрыз",    1},
  {"Ползучая погибель",       1},
  {"Речная прохлада",         1},
  {"Свистун Дерзких",         1},
  {"Смертельная западня",     1},
  {"Сторожевая гиена",        1},
  {"Сфера влияния",           1},
  {"Сфера холода",            1},
  {"Тень убийца",             1},
  {"Тень-вредитель",          1},
  {"Тень-убийца",             1},
  {"Тлеющий волк",            1},
  {"Тяп Культяпка",           1},
  {"Ходячая бомба",           1},
  {"Шипень",                  1},
  {"Чистильщик",              1},
  {"Яйцо саламандры",         1},
  {"Лунная тень",             2},
  {"Надзиратель",             2},
  {"Сингулярность",           2},
 }
end
----------------------------------------------------------------------------------------------------------
-- // Система сообщений
----------------------------------------------------------------------------------------------------------

----------------------------------------------------------------------------------------------------------
-- Панель отслеживания игроков
----------------------------------------------------------------------------------------------------------
do
----------------------------------------------------------------------------------------------------------
-- Бафы неуязвимости
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя бафа"
----------------------------------------------------------------------------------------------------------
Setings.Players.God = 
 {
  "Щит святости", 
  "Бессмертие",
  "Слово Света",
  "Воскрешение",
  "Прикосновение Света",
  "Воздушная пелена",
  "Упадок сил"
 }
----------------------------------------------------------------------------------------------------------
-- Отображаемые бафы иконками над игроками
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- {"Имя бафа", 1 или 2 (1 - отображать всегда, 2 - отображать только если "автор" бафа вы (учитывается если в настройках панели установлено отображение только своих бафов))
-- Второе поле будет учитываться если в настройках панели включен пункт "Отображать только свои бафы над игроками"
----------------------------------------------------------------------------------------------------------
Setings.Players.Ico = 
 {
  {"Баллада",             1},
  {"Бессмертие",          1},
  {"Брешь в броне",       1},
  {"Воздушная пелена",    1},
  {"Возможности призыва", 1},
  {"Воодушевление",       1},
  {"Лидерство",           1},
  {"Воскрешение",         1},
  {"Несгибаемая воля",    1},
  {"Обманувший смерть",   1},
  {"Отражения",           1},
  {"Подкрепление",        1},
  {"Прикосновение Света", 1},
  {"Слово Света",         1},
  {"Смертность",          1},
  {"Сонная стрела",       1},
  {"Щит святости",        1},
  {"Устрашающий крик",    1},
  {"Храбрость",           1},
  {"Голем захвачен!",     1},
  {"Наводчик",            1},
  {"Дубовая кора",        1},
  {"Отведение урона",     1},

  {"Тяжесть замечательного сокровища", 1},
  {"Тяжесть легендарного сокровища",   1},
  {"Тяжесть редкого сокровища",        1},
  
  {"Аутодафе",        2},
  {"Безоружность",    2},
  {"Воспламенение",   2},
  {"Ментальный блок", 2},
  {"Мир Призраков",   2},
  {"Немота",          2},
  {"Нокдаун",         2},
  {"Оглушение",       2},
  {"Огненная стена",  2},
  {"Окаменение",      2},
  {"Осиный рой",      2},
  {"Ослепление",      2},
  {"Слепота",         2},
  {"Сонное зелье",    2},
  {"Страх",           2},
  {"Сугроб",          2},
  {"Убаюкан",         2},
  {"Удушение",        2}
--  {"Дезориентация",   2}
 }
----------------------------------------------------------------------------------------------------------
-- Бафы на игроках в виде иконок в списке игроков
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя бафа"
----------------------------------------------------------------------------------------------------------
Setings.Players.Buf =
 {
  "Управление големом",
  "Возможности призыва",
  "Подкрепление",
  "Тяжесть замечательного сокровища",
  "Тяжесть редкого сокровища",
  "Тяжесть легендарного сокровища",
  "Двойной удар",
  "Регенерация",
  "Лидерство",
  "Штурмующий",
  "Наводчик",
  "Хорунжий",
  "Голем захвачен!",
  "Воодушевление",
  "Выбит из седла",
  "Брешь в броне",
  "Всадник",
  "Обманувший смерть",
  "Отражения",
  "Смертность",
  "Знамя у красных!",
  "Знамя у синих!",
  "Метка смерти",
  "Плотные нити",
  "Дикая ярость",
  "Штурмовая броня",
  "Аспект Нападения",
  "Аспект Поддержки",
  "Аспект Исцеления",
  "Аспект Подавления",
  "Аспект Защиты",

  "Отголоски войны"
  
 }
----------------------------------------------------------------------------------------------------------
-- Порядок вывода игроков по классам
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- Имя класса = номер группы (меняйте номер группы у класса, порядок строк ни на что не влияет)
----------------------------------------------------------------------------------------------------------
Setings.Players.Cls = 
 {
  PRIEST      = 1, 
  NECROMANCER = 2,
  BARD        = 3,
  WARRIOR     = 4,
  PALADIN     = 5,
  MAGE        = 6,
  DRUID       = 7,
  PSIONIC     = 8,
  ENGINEER    = 9,
  STALKER     = 10,
  WARLOCK     = 11
 } 
----------------------------------------------------------------------------------------------------------
-- Width      - Ширина панели. Диапозон 150 - 250 (по умолчанию 150)
-- Width_Guld - Увелечение ширины панели если включено отображении гильдии. Диапозон 50 - 100 (по умолчанию 80)
-- Height     - Высота строки панели. Диапазон 16 - 36 (по умолчанию 20)
-- Font_Size  - Размер шрифта надписей. Диапазон 7 - 15 (по умолчанию 11)
-- Max        - Максимальное количество отображаемых игроков. Диапазон 1 - 48 (по умолчанию 24)
-- Max_Baf    - Максимальное количество иконок бафов в строке списка. Диапазон: 1 - 5 (по умолчанию 3)
-- Max_Ico    - Максимальное количество иконок бафов над игроком. Диапазон: 1 - 7 (по умолчанию 5)
----------------------------------------------------------------------------------------------------------
Setings.Players.Width       = 150
Setings.Players.Width_Guild = 80
Setings.Players.Height      = 20
Setings.Players.Font_Size   = 11
Setings.Players.Max         = 24
Setings.Players.Max_Buf     = 3
Setings.Players.Max_Ico     = 5
----------------------------------------------------------------------------------------------------------
end
----------------------------------------------------------------------------------------------------------
-- // Панель отслеживания игроков
----------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------
-- Панель отслеживания мобов
----------------------------------------------------------------------------------------------------------
do
----------------------------------------------------------------------------------------------------------
-- Бафы неуязвимости мобов
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя бафа"
----------------------------------------------------------------------------------------------------------
Setings.Units.God =
 {
  "Барьер",
  "Демонический щит",
  "Неостановимый вихрь",
  "Презрение к смерти",
  "Сделано на совесть",
  "Сияющий покров",
  "Ядовитый взрыв",
  "Ментальный щит",
  "Плотные нити"
 }
----------------------------------------------------------------------------------------------------------
-- Бафы отражения урона на мобах
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя бафа"
----------------------------------------------------------------------------------------------------------
Setings.Units.Ref =
 {
  "Акустический барьер",
  "Крепкий панцирь",
  "Магическое зеркало",
  "Шипастая броня"
 }
----------------------------------------------------------------------------------------------------------
-- Длинный контроль
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- {"Имя контроля", за сколько секунд до окончания контроля сообщить об этом (0 - не сообщать)}
----------------------------------------------------------------------------------------------------------
Setings.Units.Con = 
 {
  {"Сугроб"            , 15},
  {"Сонное зелье"      , 15},
  {"Ментальный блок"   , 15},
  {"Мир призраков"     , 10},
  {"Окаменение"        , 15},
  {"Убаюкан"           , 10},
  {"Превращён в камень", 10},
  {"Оцепенение"        , 10},
  {"Парализующий луч"  , 10},
  {"Сон"               , 10},
  {"Водоворот"         , 10},
  {"Оковы"             , 10},
  {"Дыхание зимы"      , 0}
 }
----------------------------------------------------------------------------------------------------------
-- Отображаемые бафы иконками над мобами
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- {"Имя бафа", 1 или 2 (1 - отображать всегда, 2 - отображать только если "автор" бафа вы(учитывается если в настройках панели установлено отображение только своих бафов))
-- Второе поле будет учитываться если в настройках панели включен пункт "Отображать только свои бафы над игроками"
----------------------------------------------------------------------------------------------------------
Setings.Units.Ico = 
 {
  {"Воспламенение",  2},
  {"Ослепление",     2},
  {"Немота",         2},
  {"Оглушение",      2},
  {"Удушение",       2},
  {"Слепота",        2},
  {"Огненная стена", 2},
  {"Страх",          2},
  {"Безоружность",   2},
  {"Нокдаун",        2},
  {"Немота",         2},
  {"Аутодафе",       2},
  {"Угроза",         2},
  {"Несовершенство", 1},
  {"Тление",         1},
  {"Созвездие Мудреца",  1},
  {"Созвездие Охотника", 1},
  {"Созвездие Девы",     1},
  {"Созвездие Магистра", 1},
  {"Созвездие Мастера",  1},
  {"Звёздный барьер",    1},
  {"Отголосок звезды",   1},
  {"Рассеянный минотавр", 1},
  {"Чуткий минотавр",     1},
  {"Бдительный минотавр", 1},
 }
----------------------------------------------------------------------------------------------------------
-- Иконки бафов на мобах в списке
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя бафа"
----------------------------------------------------------------------------------------------------------
Setings.Units.Buf =
 {
  "Абсолютная свобода",
  "Акустический барьер",
  "Аура окаменения",
  "Аура оледенения",
  "Аура пожара",
  "Барьер веры",
  "Барьер",
  "Безумный танец",
  "Бессмертный",
  "Боевое безумие",
  "Боевой клич",
  "Боец Доминиона",
  "Бушующее пламя",
  "Вечное пламя",
  "Вольный ветер",
  "Вспыльчивость",
  "Гнилые кости",
  "Густой туман",
  "Двойник",
  "Демонический щит",
  "Дефективность",
  "Дикая пляска",
  "Живая трава",
  "За Родину!",
  "Здоровяк",
  "Истребление",
  "Клубы дыма",
  "Копьё бури",
  "Крабий царь",
  "Крепкая хватка",
  "Крепкий панцирь",
  "Кровожадность",
  "Лидер",
  "Лютые морозы",
  "Магическое зеркало",
  "Мать-Сыра Земля",
  "Ментальное угнетение",
  "Месть",
  "Мощь астрала",
  "Мощь огня",
  "Мститель",
  "Мученик",
  "Невосприимчивость к божественным повреждениям",
  "Невосприимчивость к природным повреждениям",
  "Невосприимчивость к стихийным повреждениям",
  "Невосприимчивость к физическим повреждениям",
  "Ненависть",
  "Неостановимый вихрь",
  "Несгибаемая воля",
  "Нескончаемый вихрь",
  "Неудержимость",
  "Неумолимое время",
  "Нусущий стужу",
  "Осторожность",
  "Перегрев",
  "Печать зноя",
  "Печать растворения",
  "Печать стужи",
  "Печать урагана",
  "Подготовка",
  "Подозрительная дрожь",
  "Презрение к смерти",
  "Разрушительный луч",
  "Рассержен!",
  "Саботаж",
  "Сбой в системе",
  "Силовой щит",
  "Сильный жар",
  "Сияющий покров",
  "Сытость",
  "Тление",
  "Увеличение",
  "Увлечённость",
  "Угроза",
  "Уменьшение",
  "Усталость",
  "Ухмылка смерти",
  "Ценный трофей",
  "Ценный",
  "Шаманизм",
  "Шипастая броня",
  "Шипастая броня",
  "Шипастая шкура",
  "Щедрость",
  "Щквал",
  "Щит мрака",
  "Эгида астрала",
  "Ядовитый взрыв",
  "Яростное сердце",
  "Ярость битвы",
  "Звёздный барьер",
}
----------------------------------------------------------------------------------------------------------
-- Width       - Ширина панели
-- Height      - Высота строки панели
-- Font_Size   - Размер шрифта надписей
-- Max         - Максимальное количество отображаемых мобов
-- Max_Baf     - Максимальное количество иконок бафов в строке списка. Диапазон: 1 - 5
-- Max_Ico     - Максимальное количество иконок бафов над мобом. Диапазон: 1 - 7
----------------------------------------------------------------------------------------------------------
Setings.Units.Width     = 320
Setings.Units.Height    = 24
Setings.Units.Font_Size = 12
Setings.Units.Max       = 24
Setings.Units.Max_Buf   = 3
Setings.Units.Max_Ico   = 3
----------------------------------------------------------------------------------------------------------
end
----------------------------------------------------------------------------------------------------------
-- // Панель отслеживания мобов
----------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------
-- Панель отслеживания бафов
----------------------------------------------------------------------------------------------------------
do
----------------------------------------------------------------------------------------------------------
-- Бафы с продолжительностью меньше 5 секунд игнорируются автоматически (можно добавить такой баф в Show он будет отображаться)
----------------------------------------------------------------------------------------------------------
-- Игнорируемые бафы
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя бафа"
----------------------------------------------------------------------------------------------------------
Setings.Bufs.Ignore = 
 {
  "Активные благословения",
  "Аномальная рассинхронизация",
  "Антитела к панацее",
  "Антитела к панацеи",
  "Астральный путешественник",
  "Бдительная стража",
  "Безоружность",
  "Благословение мученика",
  "Блокировщик",
  "Богатство",
  "Боевое безумие",
  "Болевой шок",
  "Брешь в броне",
  "Венесекция",
  "Ветер перемен",
  "Вечный огонь",
  "Вирус",
  "Вода",
  "Вулкан",
  "Выбит из седла",
  "Выброс адреналина",
  "Глубокая рана",
--  "Горение",
  "Грязь",
  "Дикий галоп",
  "Долг перед смертью",
  "Зажигательная стрела",
  "Замедление",
  "Зарядка батарей",
  "Иней вечности",
  "Иней",
  "Искры",
  "Истончающиеся тени",
  "Истощение",
  "Камень",
  "Капля",
  "Карающее зелье",
  "Ключ Мушкета Вольных",
  "Кошачья скорость",
  "Кровотечение",
  "Левая створка ворот закрыта",
  "Ледяные оковы",
  "Льды вечности",
  "Любовная лихорадка",
  "Мерзкая вонь",
  "Морозная корка",
  "Нейротоксин",
  "Немота",
  "Нет воскрешениям",
  "Нехватка адреналина",
  "Нокдаун",
  "Обморок",
  "Огненное возмездие",
  "Ожидание воскрешения",
  "Ожог",
  "Опутывающие корни",
  "Отвлекающая пульсация",
  "Отголоски безумия",
  "Открытые раны",
  "Очистительный огонь",
  "Пар",
  "Перегрузка",
  "Переутомление",
  "Пламя",
  "Пляшущий клинок",
  "Поврежденная броня",
  "Подавление воли",
  "Подключение к нейросети",
  "Пожар",
  "Покой",
  "Правая створка ворот закрыта",
  "Праздничное настроение",
  "Приток адреналина",
  "Пробитая броня",
  "Пыль",
  "Разложение",
  "Раскалённый воздух",
  "Рассечение",
  "Ровное сердцебиение",
  "Самоисцеление",
  "Связь",
  "Сердце безумца",
  "Сивушное отравление",
  "Скрытый буфф добавляет резальвенту на план Вероники",
  "Скрытый буфф добавляет резальвенту на план Милы",
  "Слепота",
  "Смертность",
  "Смерч",
  "Смирение",
  "Сонная стрела",
  "Спокойствие",
  "Стальные шарики",
  "Статический заряд",
  "Стихия воды",
  "Стихия земли",
  "Стихия огня",
  "Страх",
  "Танцы с волками",
  "Тестовый бафф",
  "Токсичная слабость",
  "Тонкая грань",
  "Удар под колено",
  "Утомление",
  "Уязвимость к стихиям",
  "Хаос",
  "Честный бой",
  "Эхо",
  '«Печать безмолвия» восстанавливается.',
  "Кислотный репеллент",
  "Наркотический репеллент",
  "Ослабляющий репеллент",
  "Новоприбывший персонаж",
  "Обычный бой",
  "Физический слой",
  "Заземление",
  
  "Усталость",
  "Перенастройка астролябии",
  "Исчезновение наёмника",
  "Сердце льда",
  "Сердце пламени",
  "Слабость Дракона",
  "Возможность подключения к интерфейсу",
  "Гимн свободы",
  "Донабор",
  "Идёт голосование",
  "Голосование завершено",
  "Ожидание прилива",
  "Быстрый перевёртыш",
  "Ношу своё бельё (скрыт)",
  "Естественный отбор",
  "Бессмертная ярость",
  "Солнцеворот",
  "Истечение чар Йокке",
  "Испытательный срок",
  "Ослеплённый любовью",
  "Ожидание чуда",
  "Без прикрытия",
  "Жрец тьмы",
  "Бессилие",
  "Покорность",
  "Отторжение тени",
  "Падение Духа",
  "Присутствие Духа",
  "Путь истинный",
  "Отрава",
  "Триумф",
  "Дезертир",
  "Пожиратель Искр",
  "Судный день",
  "Система ловушек",
  "Затуманенность Алмазного Зерцала",
  
-- Мист
  "Фиксация во времени",
  
-- Айрин
  "Общая айринская резольвента",
  
-- МИ
  "Дыхание смерти",
  
-- Хранители
  "Агония",
  "Демонический зов",
  "Демонические путы",
  
-- Компасы
  "Маковое поле",
  "Деформирован",
  "Астральный распад",
  "Изморозь",
  "Кожные повреждения",
  "Ядовитые испарения",
  "Лютая стужа",
  
-- Лабы
  "Демоническая руна",
  "Гнев Хранительницы",
  "Аура: исцеление",
  "Аура: Демоническая руна",
  "Аура: землетрясение",
  "Аура: электричество",
  "Аура: страх",
  "Аура: холод",
  "Ловушка: паника",
  "Могильный холод",
  "Положительный заряд",
  "Отрицательный заряд",
  "Обморожение",
  "Рваная рана",
  "Иссушение",
  "Поглощение Искр",
  "Белый шум",

-- Обсерватория
  "Тёмные наваждения",
  "Заражение крови",
  "Нерушимая скала",
  "Проклятье Огненного Отца",
  "Светоч",
  "Бой насмерть",
  "Проклятие Забытой",
  "Последний закат",
  "Буйное пламя",
--  "Коррозия",
  "Увечье",

-- Рейды
  "Оплот единства",
  "(технический текст) Балкон с золотой пылью",
  "(технический текст) Балкон с маслом",
  
-- Рейды
  "Страх смерти",
  "Неотвратимая гибель",

-- ЦН
  "Стужа",
  "Сковывающий ветер",
--  "Пожиратель Искр"
  
-- Зимний курорт
  "Присыпан снегом",
  
-- PvP
  "Разряд",
  "Устойчивость (Разряд)",
  "Испытание огнём",
  "Анафема",
  "Анафема (Интердикт)",
  "Слабый яд",
  "Смертельный яд",
  "Пристрел",
  "Мана-эманации",
  "Слабость",
  "Трусость",
  "Сезон охоты",
  "Уязвимость",
  "Яд сагиттария",
  "Предвестие гибели",
  "Рапсодия",
  "Ядовитые испарения",
  "Разрывной наконечник",
  "Экспрессия",
  "Кислота",
  "Кровавый Штандарт",
  "Алчные тени",
  "Лихорадка",
  "Сожжение",
  "Пожарище",
  "Отравляющие вещества",
  "Радиационный фон",
  "Расколотая броня",
  "Смертельная рана",
  "Раны"
 }
----------------------------------------------------------------------------------------------------------
-- Положительные (отрицательные с малым временем действия) бафы для отображения
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя бафа"
----------------------------------------------------------------------------------------------------------
Setings.Bufs.Show = 
 {
  "Ограниченные возможности",
  "Упоение битвой",
  "Ядовитые испарения",
  "Нестабильная бомба",
  "Я слежу за тобой!",
  "Преследование!",
  "Бутерброд",
  "Силовой экран",
  "Ледяной концентрат",
  "Усилие воли",
  "Оглушение"
 }
----------------------------------------------------------------------------------------------------------
-- Список бафов для отображения (при включенном пункте в настройках - В фильтре Рейд отображать только бафы из из списка)
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя бафа"
----------------------------------------------------------------------------------------------------------
Setings.Bufs.Only = 
 {
  "Затмение",
 }
----------------------------------------------------------------------------------------------------------
-- Имена умений при щелчке правой кнопкой мыши
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя Умения"
----------------------------------------------------------------------------------------------------------
Setings.Bufs.Skills = 
 {
  "Противоядие", "Очищение", "Очищающий заряд"
 }
----------------------------------------------------------------------------------------------------------
-- Имена умений при щелчке правой кнопкой мыши с зажатым Alt
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя Умения"
----------------------------------------------------------------------------------------------------------
Setings.Bufs.Skills_Alt = 
 {
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Имена умений при щелчке правой кнопкой мыши с зажатым Ctrl
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя Умения"
----------------------------------------------------------------------------------------------------------
Setings.Bufs.Skills_Ctrl = 
 {
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Имена умений при щелчке правой кнопкой мыши с зажатым Shift
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя Умения"
----------------------------------------------------------------------------------------------------------
Setings.Bufs.Skills_Shift = 
 {
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Time      - Огранечение по времени для отрицательный бафов в секундах (диапазон 1 - 10 секунда). Если баф отрицателен и его время действия меньше этого параметра то он не будет отображаться.
-- Width     - Ширина панели
-- Height    - Высота строки панели
-- Font_Size - Размер шрифта надписей
-- Max       - Максимальное количество отображаемых бафов
----------------------------------------------------------------------------------------------------------
Setings.Bufs.Time      = 5
Setings.Bufs.Width     = 320
Setings.Bufs.Height    = 20
Setings.Bufs.Font_Size = 11
Setings.Bufs.Max       = 24
----------------------------------------------------------------------------------------------------------
-- // Панель бафов
----------------------------------------------------------------------------------------------------------
end
----------------------------------------------------------------------------------------------------------
-- //Панель отслеживания бафов
----------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------
-- Прочее
----------------------------------------------------------------------------------------------------------
do
----------------------------------------------------------------------------------------------------------
-- Список действий у юнитов, которые автоматически выбирать
----------------------------------------------------------------------------------------------------------
Setings.Other.Action_Auto = 
 {
  "Отправиться в Астральную академию",
  "Отправиться в ангар",
  "Оплатить воскрешение",
  "Оседлать дрейка",
  "Войти в Омут",
  "Отправиться в Лавку Редкостей",
  "Переместиться в Пирамиду Тэпа",
  "Просмотреть список Воплощений.",
  "Приступить к испытаниям",
  "Пнуть идол",
  "Лёгкая сложность",
  "Представь, как станут тебя уважать, когда узнают, с каким чудищем ты сражался!",
  "Подумай о других! Неужели ты дашь им погибнуть?!",
  "Ни один настоящий орк не устрашится смерти в бою!",
  "Начать испытание",
  "Обезопасить себя от излишней жадности",
  "Принять предложение"
--  "Открыть сундук",
--  "Забрать свиток",
--  "Прочитать записку"
 }
end
----------------------------------------------------------------------------------------------------------
-- //Прочее
----------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------
-- Мини панели бафов 
----------------------------------------------------------------------------------------------------------
do
----------------------------------------------------------------------------------------------------------
-- Пример панели
----------------------------------------------------------------------------------------------------------
--Setings.Minis.Buf[Номер] = -- Номер должен быть в дипазоне от 1 до 10
-- {
--  Use        = 1,       -- Использовать/не использовать панель (1 - использовать, 0 - не использовать)
--  Tip        = 1,       -- Тип панели (1 - бафы на персонаже с указанием номера положения бафа в строке, 2 - бафы на персонаже с отображением бафов в порядке поступления, 3 - бафы на цели персонажа)
--  Size_Ico   = 40,      -- Размер иконки бафа в пикселях должен быть в диапозоне от 20 до 80 при выходе за диапозон устанавливается размер 40
--  Size_Font  = 15,      -- Размер шрифта надписи на бафе (время действия и количество стаков) должен быть в диапозоне от 10 до 30 при выходе за диапозон устанавливается размер 15
--  Font_Color = "white", -- Цвет шрифта надписи (Красный - red, Зеленый - green, Желтый - yellow, Пурпурный - purpure, Синий - blue, Белый - white)
--  Max        = 10,      -- Максимальное количество отображаемых бафов (должно быть в дипазоне от 1 до 20 при выходе за дипазон устанавливается в 10, не влияет на размер панели Тип №1)
--  
--  Для панели Тип № 1      -- {"Имя класса", "Имя бафа", Номер позиции для отображени в панели},
--  Для панели Тип № 2 и  3 -- "Имя бафа",
-- }
----------------------------------------------------------------------------------------------------------
-- Имена классов при добавлении бафа
-- Маг       - MAGE
-- Жрец      - PRIEST
-- Паладин   - PALADIN
-- Некромант - NECROMANCER
-- Бард      - BARD
-- Друид     - DRUID
-- Воин      - WARRIOR
-- Мистик    - PSIONIC
-- Лучник    - STALKER
-- Инженер   - ENGINEER
-- Демон     - WARLOCK
----------------------------------------------------------------------------------------------------------
-- Панель №1
----------------------------------------------------------------------------------------------------------
Setings.Minis.Buf[1] = 
 {
  Use        = 1,
  Tip        = 1,
  Max        = 1,
  Size_Ico   = 40,
  Size_Font  = 15,
  Font_Color = "white",
  -- Маг
  {"MAGE", "Стремительное колдовство", 1},
  {"MAGE", "Гармония",                 2},
  {"MAGE", "Вечная мерзлота"     ,     3},
  {"MAGE", "Штормовое предупреждение", 4},
  {"MAGE", "Колдовской барьер"  ,      5},
  {"MAGE", "Слабость"  ,      6},
  -- Жрец
  {"PRIEST", "Фанатизм"              , 1},
  {"PRIEST", "Активные благословения", 2},
  {"PRIEST", "Внезапный Разряд"      , 3},
  {"PRIEST", "Напутствие"            , 4},
  -- Паладин
  {"PALADIN", "Канон Чистоты"    , 1},
  {"PALADIN", "Канон Света"      , 2},
  {"PALADIN", "Сосредоточенность", 3},
  {"PALADIN", "Вдохновение"      , 4},
  {"PALADIN", "Святая ярость"    , 5},
  -- Некромант
  {"NECROMANCER", "Экстаз Отравителя", 1},
  -- Бард
  {"BARD", "Воодушевление", 1},
  {"BARD", "Эйфория"      , 2},
  {"BARD", "Реверберация" , 2}
 }
----------------------------------------------------------------------------------------------------------
-- Панель №2
----------------------------------------------------------------------------------------------------------
Setings.Minis.Buf[2] = 
 {
  Use        = 1,
  Tip        = 2,
  Max        = 5,
  Size_Ico   = 40,
  Size_Font  = 15,
  Font_Color = "white",
  --
  "Стремление к тьме",
  "Стремление к свету",
  "Несгибаемая воля",
  "Щит святости",
  "Покров скорости",
  "Невидимость"
 }
----------------------------------------------------------------------------------------------------------
-- Панель №3
----------------------------------------------------------------------------------------------------------
Setings.Minis.Buf[3] = 
 {
  Use        = 1,
  Tip        = 2,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 15,
  Font_Color = "white",
  "Напутствие",
  "Воодушевление",
  "Крылья ворона",
  "Зелье концентрации",
  "Негасимый Свет",
  "Слабость"
 }
----------------------------------------------------------------------------------------------------------
-- Панель №6 (Бафы на цели)
----------------------------------------------------------------------------------------------------------
Setings.Minis.Buf[4] = 
 {
  Use        = 1,
  Tip        = 3,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 15,
  Font_Color = "white",
  --
  "Напутствие",
  "Воодушевление",
  --
 }
----------------------------------------------------------------------------------------------------------
-- Панель №5
----------------------------------------------------------------------------------------------------------
Setings.Minis.Buf[5] = 
 {
  Use        = 0,
  Tip        = 2,
  Max        = 1,
  Size_Ico   = 40,
  Size_Font  = 15,
  Font_Color = "white",
  --
  ""
}
----------------------------------------------------------------------------------------------------------
-- Панель №6
----------------------------------------------------------------------------------------------------------
Setings.Minis.Buf[6] = 
 {
  Use        = 0,
  Tip        = 2,
  Max        = 1,
  Size_Ico   = 40,
  Size_Font  = 15,
  Font_Color = "white",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №7
----------------------------------------------------------------------------------------------------------
Setings.Minis.Buf[7] = 
 {
  Use        = 0,
  Tip        = 2,
  Max        = 1,
  Size_Ico   = 40,
  Size_Font  = 15,
  Font_Color = "white",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №8
----------------------------------------------------------------------------------------------------------
Setings.Minis.Buf[8] = 
 {
  Use        = 0,
  Tip        = 2,
  Max        = 1,
  Size_Ico   = 40,
  Size_Font  = 15,
  Font_Color = "white",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №9
----------------------------------------------------------------------------------------------------------
Setings.Minis.Buf[9] = 
 {
  Use        = 0,
  Tip        = 2,
  Max        = 1,
  Size_Ico   = 40,
  Size_Font  = 15,
  Font_Color = "white",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №10
----------------------------------------------------------------------------------------------------------
Setings.Minis.Buf[10] = 
 {
  Use        = 0,
  Tip        = 2,
  Max        = 1,
  Size_Ico   = 40,
  Size_Font  = 15,
  Font_Color = "white",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
end
----------------------------------------------------------------------------------------------------------
-- // Мини панели бафов
----------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------
-- Панели зелий
----------------------------------------------------------------------------------------------------------
do
----------------------------------------------------------------------------------------------------------
-- Пример панели
----------------------------------------------------------------------------------------------------------
--Setings.Potions.Potion[Номер] = -- Номер должен быть в дипазоне от 1 до 10
-- {
--  Use        = 1,       -- Использовать/не использовать панель  (1 - использовать, 0 - не использовать)
--  Max        = 10,      -- Максимальное количество кнопок в панели (должен быть в диапозоне от 1 до 20 при выходе за диапазон устанавливается размер 10)
--  Size_Ico   = 40,      -- Размер иконки бафа в пикселях должен быть в диапозоне от 20 до 80 при выходе за диапозон устанавливается размер 40
--  Size_Font  = 13,      -- Размер шрифта надписи на бафе (время действия и количество стаков) должен быть в диапозоне от 10 до 30 при выходе за диапозон устанавливается размер 13
--  Font_Color = "white", -- Цвет шрифта надписи (Красный - red, Зеленый - green, Желтый - yellow, Пурпурный - purpure, Синий - blue, Белый - white)
--  "Имя или часть имени",
-- }
-- В каком порядке здесь добавляются строки в таком порядке и будут отображаться на панели (при условии наличия предмета в сумке)
----------------------------------------------------------------------------------------------------------
-- формат добавления
-- "Имя или часть имени"
----------------------------------------------------------------------------------------------------------
-- Панель №1
----------------------------------------------------------------------------------------------------------
Setings.Potions.Potion[1] =
 {
  Use        = 1,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "white",
  --
  "исцеления",
  "восстановления",
  "магической силы",
  "зелье",
  "эликсир",
  "отвар",
  "отрава",
  "вытяжка",
  "склянка",
  "бальзам",
  "снадобье",
  "Снадобье"
 }
----------------------------------------------------------------------------------------------------------
-- Панель №2
----------------------------------------------------------------------------------------------------------
Setings.Potions.Potion[2] =
 {
  Use        = 1,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  "Громобой",
  "Копия типовой турели"
 }
----------------------------------------------------------------------------------------------------------
-- Панель №3
----------------------------------------------------------------------------------------------------------
Setings.Potions.Potion[3] =
 {
  Use        = 1,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  "Энергетический кристалл",
  "Огромный кистень",
  "Окровавленный клинок",
  "Острая стрела",
  "Склянка с травяным настоем",
  "Зачарованный череп"
 }
----------------------------------------------------------------------------------------------------------
-- Панель №4
----------------------------------------------------------------------------------------------------------
Setings.Potions.Potion[4] =
 {
  Use        = 0,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №5
----------------------------------------------------------------------------------------------------------
Setings.Potions.Potion[5] =
 {
  Use        = 0,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №6
----------------------------------------------------------------------------------------------------------
Setings.Potions.Potion[6] =
 {
  Use        = 0,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №7
----------------------------------------------------------------------------------------------------------
Setings.Potions.Potion[7] =
 {
  Use        = 0,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №8
----------------------------------------------------------------------------------------------------------
Setings.Potions.Potion[8] =
 {
  Use        = 0,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №9
----------------------------------------------------------------------------------------------------------
Setings.Potions.Potion[9] =
 {
  Use        = 0,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №10
----------------------------------------------------------------------------------------------------------
Setings.Potions.Potion[10] =
 {
  Use        = 0,
  Max        = 10,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
end
----------------------------------------------------------------------------------------------------------
-- // Панель зелий
----------------------------------------------------------------------------------------------------------

----------------------------------------------------------------------------------------------------------
-- Панели умения
----------------------------------------------------------------------------------------------------------
do
----------------------------------------------------------------------------------------------------------
-- Пример панели
----------------------------------------------------------------------------------------------------------
--Setings.Skills.Skill[Номер] =       - Номер должен быть в дипазоне от 1 до 10
-- {
--  Use        = 1,       - Использовать/не использовать панель  (1 - использовать, 0 - не использовать)
--  Size_Ico   = 40,      - Размер иконки бафа в пикселях должен быть в диапозоне от 20 до 80 при выходе за диапозон устанавливается размер 40
--  Size_Font  = 13,      - Размер шрифта надписи на бафе (время действия и количество стаков) должен быть в диапозоне от 10 до 30 при выходе за диапозон устанавливается размер 13
--  Font_Color = "white", - Цвет шрифта надписи (Красный - red, Зеленый - green, Желтый - yellow, Пурпурный - purpure, Синий - blue, Белый - white)
--  "Имя бафа",
-- }
----------------------------------------------------------------------------------------------------------
-- Панель №1
----------------------------------------------------------------------------------------------------------
Setings.Skills.Skill[1] = 
 {
  Use        = 1,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  "Негасимый Свет",
  "Великая Сила Света",
  "Сила Света",
  "Праведный Дух",
  "Великая Сила Духа",
  "Сила Духа",
  "Стальная Воля",
  "Великая Сила Воли",
  "Сила Воли",
  "Литания",
  "Великая Милость",
  "Милость",
 }
----------------------------------------------------------------------------------------------------------
-- Панель №2
----------------------------------------------------------------------------------------------------------
Setings.Skills.Skill[2] = 
 {
  Use        = 1,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  "Покров скорости",
  "Карьер"
 }
----------------------------------------------------------------------------------------------------------
-- Панель №3
----------------------------------------------------------------------------------------------------------
Setings.Skills.Skill[3] = 
 {
  Use        = 0,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №4
----------------------------------------------------------------------------------------------------------
Setings.Skills.Skill[4] = 
 {
  Use        = 0,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №5
----------------------------------------------------------------------------------------------------------
Setings.Skills.Skill[5] = 
 {
  Use        = 0,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №6
----------------------------------------------------------------------------------------------------------
Setings.Skills.Skill[6] = 
 {
  Use        = 0,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №7
----------------------------------------------------------------------------------------------------------
Setings.Skills.Skill[7] = 
 {
  Use        = 0,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №8
----------------------------------------------------------------------------------------------------------
Setings.Skills.Skill[8] = 
 {
  Use        = 0,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №9
----------------------------------------------------------------------------------------------------------
Setings.Skills.Skill[9] = 
 {
  Use        = 0,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
----------------------------------------------------------------------------------------------------------
-- Панель №10
----------------------------------------------------------------------------------------------------------
Setings.Skills.Skill[10] = 
 {
  Use        = 0,
  Size_Ico   = 40,
  Size_Font  = 13,
  Font_Color = "yellow",
  --
  ""
 }
end
----------------------------------------------------------------------------------------------------------
-- // Панели умения
----------------------------------------------------------------------------------------------------------