--------------------------------------------------------------------------------
-- LOCALES
--------------------------------------------------------------------------------
Global( "Locales", {
	["Русский"] = { -- Russian, Win-1251
		["Zones_On"]={["Руины Ал-Риата"]=true, ["Осколки Айрина"]=true, ["Суслангер"]=true},
		["Сундук"]={["Руины Ал-Риата"]="Поблизости Сундук!"},
		["Пыльца фей"]={["Осколки Айрина"]="Рядом Пыльца!"},
		["Экю"]={["Осколки Айрина"]="Экю!"},
		["Сокровище"]={["Суслангер"]="Поблизости Сокровище!"},
        ["Большое сокровище"]={["Суслангер"]="Поблизости Большое сокровище!"},
	},
	["rus"] = { -- Russian, Win-1251
		["Zones_On"]={["Руины Ал-Риата"]=true, ["Осколки Айрина"]=true, ["Суслангер"]=true},
		["Сундук"]={["Руины Ал-Риата"]="Поблизости Сундук!"},
		["Пыльца фей"]={["Осколки Айрина"]="Рядом Пыльца!"},
		["Экю"]={["Осколки Айрина"]="Экю!"},
		["Сокровище"]={["Суслангер"]="Поблизости Сокровище!"},
        ["Большое сокровище"]={["Суслангер"]="Поблизости Большое сокровище!"},
	},	
	["eng"] = { -- English, Latin-1
		["Zones_On"]={["Al Rihat Ruins"]=true,},
		["Strongbox"]={["Al Rihat Ruins"]="The Strongbox is nearbly!"},
	},
	["eng_eu"] = { -- English 2, Latin-1
		["Zones_On"]={["Al Rihat Ruins"]=true,},
		["Strongbox"]={["Al Rihat Ruins"]="The Strongbox is nearbly!"},
	},	
	["ger"] = { -- German, Win-1252
		["Zones_On"]={["Al Rihat Ruins"]=true,},
		["Strongbox"]={["Al Rihat Ruins"]="The Strongbox is nearbly!"},
    },
	["fra"] = { -- French,
		["Zones_On"]={["Al Rihat Ruins"]=true,},
		["Strongbox"]={["Al Rihat Ruins"]="The Strongbox is nearbly!"},
	},

} )

